# Semana 2 do Aceleradev DS Codenation

### Professor: Túlio Vieira de Souza  |  Tema: Manipulação de Dados e Análise Descritiva

In [133]:
import pandas as pd
import matplotlib.pyplot as plt
import numpy as np

como pedir __ajuda__ para descobrir o que os métodos fazem?
```python
pacote?
pacote.método?
```

In [134]:
pd.read_csv?

Para ilustrar o funcionamento do pacote __Pandas__, e até para nos acostumarmos à manipulação de dados, é necessário aprender mexer com __DICIONÁRIOS__

In [167]:
dados = {
    'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
    'acessos': [100, 200, 300, 400, 400],
    'site': ['site1', 'site2', 'site3', 'site4', np.nan],
    'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

Diferente da maioria das IDEs, o notebook retorna os valores de uma variável rodando ela simplesmente, sem precisar  da função print()

In [136]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 400],
 'site': ['site1', 'site2', 'site3', 'site4', nan],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300]}

Um dicionário tem a seguinte __estrutura__:

* *.keys()*: são os __Títulos__ das colunas. No nosso dicionário são canal_vendas, acessos, site, vendas
* *.values()*: são os __Valores__ que as colunas carregam. No nosso dicionário são as listas
* *.items()*: são os __CONJUNTOS__ de _keys_ e _values_. No nosso exemplo, 'acessos':[100, 200, 300, 400, 500] é um item

In [137]:
dados.keys()

dict_keys(['canal_venda', 'acessos', 'site', 'vendas'])

In [138]:
dados.values()  # este retorna uma LISTA de LISTAS

dict_values([['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'], [100, 200, 300, 400, 400], ['site1', 'site2', 'site3', 'site4', nan], [1000.52, 1052.34, 2002, 5000, 300]])

In [139]:
dados.items()  # este retorna uma LISTA de TUPLAS

dict_items([('canal_venda', ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook']), ('acessos', [100, 200, 300, 400, 400]), ('site', ['site1', 'site2', 'site3', 'site4', nan]), ('vendas', [1000.52, 1052.34, 2002, 5000, 300])])

Podemos verificar o tipo de uma variável com o comando
```python
type(variável)
```

In [140]:
type(dados)

dict

In [141]:
type(dados['acessos'])

list

In [142]:
type(dados.items())

dict_items

Quando temos colunas que seus _.values()_ são listas, podemos usar as propriedades de __slicing__
* [n]
* [:n]
* [n:]
* [-n]

In [143]:
dados['acessos'][0]

100

In [144]:
dados['acessos'][1:3]

[200, 300]

In [145]:
dados['acessos'][-1]

400

In [146]:
dados['acessos'][:3]

[100, 200, 300]

Também é importante saber manipular __LISTAS__, pois várias das _.keys()_ dos dicionários estão nesse formato. Uma lista nada mais é que uma variável composta que possui seus valores dentro de [ ] e são indexados
```python
[1, 'a', 3.5, 6, ...]
```

In [147]:
[1, 3, 'a', 4.5]

[1, 3, 'a', 4.5]

In [148]:
type([1, 2, 3])

list

Para adicionar novos conjuntos de valores a um dicionário
```python
dicionario['nova key'] = valor
```

In [149]:
dados['lista'] = [1, 2, 3, 4, 'a']

In [150]:
dados

{'canal_venda': ['facebook', 'twitter', 'instagram', 'linkedin', 'facebook'],
 'acessos': [100, 200, 300, 400, 400],
 'site': ['site1', 'site2', 'site3', 'site4', nan],
 'vendas': [1000.52, 1052.34, 2002, 5000, 300],
 'lista': [1, 2, 3, 4, 'a']}

Feitas tais considerações, podemos fazer o nosso primeiro __DataFrame__

In [151]:
pd.DataFrame?

In [152]:
dataframe = pd.DataFrame(dados)

In [153]:
dataframe

  canal_venda  acessos   site   vendas lista
0    facebook      100  site1  1000.52     1
1     twitter      200  site2  1052.34     2
2   instagram      300  site3  2002.00     3
3    linkedin      400  site4  5000.00     4
4    facebook      400    NaN   300.00     a

Quando um df é muito grande, ele não é impresso na integra, somente os valores iniciais e finais são mostrados. Mas é possível acessá-los separadamente com os comandos
```python
df.head(número_de_linhas)
df.tail(número_de_linhas)
```

In [154]:
dataframe.head(2)

  canal_venda  acessos   site   vendas lista
0    facebook      100  site1  1000.52     1
1     twitter      200  site2  1052.34     2

In [155]:
dataframe.tail(1)

  canal_venda  acessos site  vendas lista
4    facebook      400  NaN   300.0     a

Como maneira prática, podemos ver a "cara" do conjunto de dados usando o comando (@property)
```python
df.shape
```
ele retorna uma tupla que diz quantidade de linhas e colunas do df, sendo (linha, coluna)

In [156]:
dataframe.shape

(5, 5)

Podemos ver também os Indices do df usando o método
```python
df.index
```

In [157]:
dataframe.index

RangeIndex(start=0, stop=5, step=1)

É possível ver também quais tipos primitivos os dados do df possuem
```python
df.dtypes
```

In [158]:
dataframe.dtypes  # porém não é tão confiável, pois na coluna "lista" 4 valores são int64 e 1 é object

canal_venda     object
acessos          int64
site            object
vendas         float64
lista           object
dtype: object

Podemos ver mais a fundo as características do df com o método
```python
df.info()
```

In [159]:
pd.DataFrame.info?

In [160]:
dataframe.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   canal_venda  5 non-null      object
 1   acessos      5 non-null      int64
 2   site         4 non-null      object
 3   vendas       5 non-null      float64
 4   lista        5 non-null      object
dtypes: float64(1), int64(1), object(3)
memory usage: 328.0+ bytes

É possível também fazer um resumo das informações do seu df com o comando
```python
df.describe()
```

In [161]:
dataframe.describe()

          acessos       vendas
count    5.000000     5.000000
mean   280.000000  1870.972000
std    130.384048  1850.931024
min    100.000000   300.000000
25%    200.000000  1000.520000
50%    300.000000  1052.340000
75%    400.000000  2002.000000
max    400.000000  5000.000000

Quando temos valores iguais numa coluna, não precisamos fazer um _for_ e implementar um contador para descobrir quantas vezes um mesmo valor aparece, basta usar o método
```python
Series.value_counts()
```

In [162]:
dataframe['canal_venda'].value_counts()

facebook     2
twitter      1
linkedin     1
instagram    1
Name: canal_venda, dtype: int64

Em colunas numéricas, podemos fugir das iterações para certas operações simples com os métodos
* Series.count() retorna o __Número__ de valores da coluna
* Series.sum() retorna a __Soma__ dos valores da coluna
* Series.max() retorna o valor __Máximo__ da coluna
* Series.min() retorna o valor __Mínimo__ da coluna
* Series.mean() retorna a __Média__ da coluna
* Series.median() retorna a __Mediana__ da coluna
* Series.mode() retorna a __Moda__

In [163]:
dataframe['acessos'].sum()

1400

In [164]:
dataframe['acessos'].mode()  # embora mostre dois valores, o primeiro é um índice apenas

0    400
dtype: int64

Uma coisa que nos depararemos __MUITO__ é nos dados faltantes, sejam eles _Nan_ ou _Nulls_. E para lidar com esse tipo de dado, usamos os métodos
* df.isna() retorna um valor booleano __True__ na posição do valor *NaN*, e **False** na posição que não é 
* df.isnull() retorna um valor booleano na  __True__ na posição do valor *Null*,e **False** na posição que nã é

In [168]:
dataframe.isna()

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False   True   False  False

In [170]:
dataframe.isnull()  # embora não pareça, eles tem diferença

   canal_venda  acessos   site  vendas  lista
0        False    False  False   False  False
1        False    False  False   False  False
2        False    False  False   False  False
3        False    False  False   False  False
4        False    False   True   False  False

Podemos unir dois métodos que já vimos para visualizar melhor a quantidade de *Nan* ou *Null* que podem existir num df, já que df muito grandes não se imprime todos os seus valores na tela. Podemos escolher uma coluna e
```python
Series.isna().value_counts()
```

In [172]:
dataframe['site'].isna()

0    False
1    False
2    False
3    False
4     True
Name: site, dtype: bool

In [174]:
dataframe['site'].isna().value_counts()

False    4
True     1
Name: site, dtype: int64

É possível adicionar novas colunas no df assim como um dicionário
```python
df['título'] = [lista de valores]
```

Da mesma forma que é possivel acessar valores tal qual um dicionário, embora existam maneiras muito mais eficientes
```python
df['Título'][formas de slicing]
```

In [198]:
dataframe['acessos'][:3]

0    100
1    200
2    300
Name: acessos, dtype: int64

In [176]:
dataframe['lista_2'] = [4, 5, 6, 7, 9]
dataframe

  canal_venda  acessos   site   vendas lista  lista_2
0    facebook      100  site1  1000.52     1        4
1     twitter      200  site2  1052.34     2        5
2   instagram      300  site3  2002.00     3        6
3    linkedin      400  site4  5000.00     4        7
4    facebook      400    NaN   300.00     a        9

Podemos consultar as colunas do df também
```python
df.columns
```

In [191]:
dataframe.columns

Index(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'lista_2'], dtype='object')

Caso o df tenha muitas colunas, talvez nao revele todas elas dessa maneira, mas dessa revela
```python
df.columns.values
```

In [194]:
dataframe.columns.values

array(['canal_venda', 'acessos', 'site', 'vendas', 'lista', 'lista_2'],
      dtype=object)

Podemos modificar os títulos das colunas de um df de algumas maneiras, mas como os df geralmente são muito grandes e com muitas colunas, o melhor jeito é com o método
```python
df.rename(columns={'Título Atual': 'Título Novo', ...}, inplace=True ou False)
```
Lembrando que o parâmetro Inplace modifica o df em todas as suas requisições caso seu valor seja *True*

In [196]:
pd.DataFrame.rename?

In [199]:
dataframe.rename(columns={'canal_venda': 'plataforma_venda', 'acessos':'visualizações'})

  plataforma_venda  visualizações   site   vendas lista  lista_2
0         facebook            100  site1  1000.52     1        4
1          twitter            200  site2  1052.34     2        5
2        instagram            300  site3  2002.00     3        6
3         linkedin            400  site4  5000.00     4        7
4         facebook            400    NaN   300.00     a        9

Outra forma bem simples para mudar o título de um coluna
```python
Series.name = 'Título'
```

In [205]:
variavel = dataframe['vendas']
variavel.name = 'sellings'
variavel  # será útil quando entrarmos em join

0    1000.52
1    1052.34
2    2002.00
3    5000.00
4     300.00
Name: sellings, dtype: float64

Outro método que serve pra tudo que é _string_ é o
```python
str.replace('caracter ou string antiga', 'caracter ou string nova')
str.replace({'string antiga': 'string nova', 'string antiga': 'string nova', ...})
```

In [208]:
pd.Series.str.replace?

In [213]:
dataframe.columns.str.replace('_', ' ')  # dataframe.columns = dataframe.columns.str.replace('_', ' ')

Index(['canal venda', 'acessos', 'site', 'vendas', 'lista', 'lista 2'], dtype='object')

In [218]:
a = dataframe.copy()

In [220]:
a.columns = a.columns.str.replace('_', ' ')
a

  canal venda  acessos   site   vendas lista  lista 2
0    facebook      100  site1  1000.52     1        4
1     twitter      200  site2  1052.34     2        5
2   instagram      300  site3  2002.00     3        6
3    linkedin      400  site4  5000.00     4        7
4    facebook      400    NaN   300.00     a        9

Para __EXCLUIR__ colunas de um df
```python
df.drop(columns=['Título', 'Título', ...], inplace=True ou False)
df.drop(columns='Título', inplace=True ou False)
```

In [231]:
dataframe.drop(columns='lista_2')

  canal_venda  acessos   site   vendas lista
0    facebook      100  site1  1000.52     1
1     twitter      200  site2  1052.34     2
2   instagram      300  site3  2002.00     3
3    linkedin      400  site4  5000.00     4
4    facebook      400    NaN   300.00     a

In [234]:
dataframe.drop(columns=['lista', 'lista_2'])

  canal_venda  acessos   site   vendas
0    facebook      100  site1  1000.52
1     twitter      200  site2  1052.34
2   instagram      300  site3  2002.00
3    linkedin      400  site4  5000.00
4    facebook      400    NaN   300.00